Repository: 84000/data-translation-memory
Catalog: toh62-v3.tmx
Source language: bo
Languages: en

source: །ཚིག་དེ་ཐོས་ནས་བདག་འདིར་ཡིད་ནི་བདེ་བར་གྱུར།
en: Having heard your words, my mind is now delighted.’

source: །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་ལྷ་དེ་དག་གིས་རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་ལ་ཚིགས་སུ་བཅད་པས་སླར་སྨྲས་པ།
en: “At this point, Rāṣṭrapāla, the gods uttered the following verse to young prince Puṇyaraśmi:

source: གཞོན་ནུ་ཁྱོད་ཀྱིས་སངས་རྒྱས་ཐོས་པར་མ་གྱུར་ཏམ།
en: “ ‘O prince, have you not heard of the Buddha

source: །དོན་གྲུབ་བློ་ཞེས་བྱ་སྟེ་སྐྱབས་མེད་རྣམས་ཀྱི་སྐྱབས།
en: Called Siddhārthabuddhi, the refuge for those without refuge?

source: །དེ་བཞིན་སྤྱོད་མཁས་བསོད་ནམས་ཤེས་རབ་ཡོན་ཏན་མཆོག །དེ་ཡི་དགེ་འདུན་ཁྲག་ཁྲིག་སྟོབས་བཅུ་བསམ་གཏན་པ།
en: He is skilled in conduct, endowed with highest merit, insight, and qualities. His assembly consists of countless meditators.’

source: །བསོད་ནམས་ཀྱི་འོད་ཟེར་གྱིས་སྨྲས་པ།
en: “Puṇyaraśmi replied:

source: བདག་ནི་རྒྱལ་བ་ལྟ་འཚལ་དེ་ཡི་གཟུགས་ཅི་འདྲ།
en: “ ‘May I, too, behold the Victorious One!

source: །དེ་ཡི་ཁ་དོག་ཅི་འདྲ་ཐམས་ཅད་བཀའ་སྩོལ་ཅིག །ཇི་ལྟར་སྤྱད་ན་སེམས་ཅན་ཀུན་མགོན་གཅིག་འགྱུར་བ།
en: Please tell me everything: What are his body and complexion like? How should one practice to become a protector for all sentient beings?

source: །བྱང་ཆུབ་སྤྱོད་པ་ཅི་འདྲ་བདག་ནི་ཡོངས་སུ་འདྲི།
en: What is the conduct of a bodhisattva like?’

source: །དེ་ནས་ལྷ་དེ་དག་གིས་རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་ལ་ཚིགས་སུ་བཅད་པས་སླར་སྨྲས་པ།
en: “The gods then uttered the following verses to young prince Puṇyaraśmi:

source: དེ་ཡི་གཙུག་ཏོར་དེ་ཡི་རྩེ་ལ་གསེར་མཛེས་བཞིན།
en: “ ‘His uṣṇīṣa is as beautiful as gold on a mountain summit.

source: །དབུ་སྐྲ་འཇམ་ཞིང་མཛེས་ལ་གཡས་སུ་འཁྱིལ་བ་སྟེ།
en: His hair, curling to the right, is soft and lovely.

source: །དེ་ཡི་མཛོད་སྤུ་མཁའ་ལ་ཉི་ལྟར་ལྷམ་མེ་བ།
en: The hair tuft between his eyebrows, blazing like the sun in the sky,

source: །ནོར་བུ་ཤེལ་ལྟར་རྣམ་པར་དག་ཅིང་གཡས་སུ་འཁྱིལ།
en: Is completely pure like a crystal jewel, and it curls to the right.

source: །སྤྱན་དག་བུང་བའི་ཚོགས་དང་ཨུད་པ་ལ་སྔོན་པོ་འདྲ།
en: “ ‘His pure eyes are like a swarm of bees and blue lotuses.

source: །མི་དབང་སེང་གེའི་འགྲམ་པ་རང་བྱུང་བིམ་པའི་སྒྲོས།
en: He, the lord of men—endowed with jaws of a lion and lips like the self-arisen bimba fruit—

source: །སེམས་ཅན་ལྷན་ཅིག་འོད་ཟེར་བྱེ་བ་མཐའ་ཡས་འགྱེད།
en: Radiates myriad boundless light rays simultaneously to all sentient beings,

source: །སྟོང་གསུམ་རྒྱས་པར་འགེངས་ཤིང་ངན་འགྲོ་རྣམས་ཀྱང་སྐེམས།
en: And thus illuminates the trichiliocosm and dries up the lower realms.

source: །དེ་ཡི་ཚེམས་ནི་རབ་དཀར་ཁ་བ་དངུལ་ལྟར་དག །བཞི་བཅུ་མཉམ་ཞིང་ཐགས་བཟང་རྨད་བྱུང་ལེགས་པར་གྲུབ།
en: “ ‘His forty teeth, pure like glittering white snow or silver, Are straight, without gaps, and marvelously well arranged.

source: །རྒྱལ་བ་དམ་པ་མཆོག་དེའི་ཚེམས་ཀྱི་མཆེ་བ་བཞི།
en: The supreme and excellent Victorious One has four eye teeth,

source: །དེ་ཡི་ལྗགས་ནི་རབ་ཡངས་རང་གི་ཞལ་གདོང་ཁེབས།
en: And his large tongue could cover his face.

source: །རྒྱལ་བ་དེ་ཡི་གསུང་ནི་རི་མཆོག་འདྲ་བའི་དོན།
en: “ ‘The speech of the Victorious One is majestic like the highest mountain.

source: །ཤིན་ཏུ་ཚིམ་བྱེད་འབྲེལ་ཅིང་གྱ་གྱུ་མེད་པ་སྟེ།
en: It is exceptionally satisfying, coherent, and honest.

source: །ཚངས་དབྱངས་ཤིན་ཏུ་སྙན་པ་སིལ་སྙན་སྟོང་འདྲ་བ།
en: His Brahmā voice is melodious, like a thousand cymbals;

source: །ཡིད་གཉིས་འཇོམས་པ་འདོད་པ་རྣམས་ནི་ཚིམ་བྱེད་པ།
en: It alleviates doubts and satisfies all longings.

source: །རྒྱལ་བའི་གསུང་ནི་ལྷ་ཡི་སྒྲ་སྐད་ཚིམ་བྱེད་པ།
en: “ ‘The speech of the Victorious One delights like a chorus of the gods.

source: །ཡོན་ཏན་སྣ་ཚོགས་ཚང་བ་བྱང་ཆུབ་ཡན་ལག་འཐུན།
en: All its manifold qualities are complete, in accord with the branches of enlightenment.

source: །ཆོས་ཀྱི་ཕྲེང་བ་ཡིད་འོང་བརྒྱ་སྟོང་རབ་བརྒྱུས་པ།
en: It is a charming hundred-thousand-threaded Dharma garland,

source: །སིལ་སྙན་དགའ་བ་བསྒྲགས་པ་ལྷ་ཀླུ་ཉམས་དགའ་བ།
en: Resounding like delightful cymbals and pleasing gods and nāgas.

source: །མི་ཅི་ཀ་ལ་པིང་ཀ་ཁུ་བྱུག་ངུར་པ་དང་། །རྨ་བྱ་ངང་པ་སྒྲ་སྙན་ཀུ་ན་ལ་ཡི་སྒྲ།
en: “ ‘It has the melodies of kinnaras and the calls of kalaviṅka birds, cuckoos, wild geese, peacocks, geese, and kuṇāla birds—

source: །ཚངས་པའི་སྒྲ་དབྱངས་མི་ཅི་དབྱངས་ཀྱི་ཡན་ལག་འདྲ།
en: A symphony of sounds like a melodious Brahmā voice. The melodies of kinnaras are guileless and faultless,

source: །མ་འཁྲུལ་སྡིག་མེད་དོན་རྣམས་ཐམས་ཅད་རྟོགས་བྱེད་པ།
en: Fostering the realization of all aims.

source: །རྨད་བྱུང་ཤེལ་ལྟར་འཇམ་ཞིང་མཁས་པའི་ཡིད་འོང་བ།
en: “ ‘Smooth like a marvelous crystal, delighting the learned ones,

source: །སྐུལ་བ་འདུལ་བར་འགྱུར་བ་སྤྱོད་པ་དགར་འགྱུར་བ།
en: Inspiring, calming, enlightening, and pleasing;

source: །གཞན་གྱི་སྤྱོད་དང་འཐུན་པ་ཞུས་ན་ཚིམ་བྱེད་པ།
en: In accord with the highest conduct, and satisfying questions:

source: །ཆོས་ཀྱི་དབང་ཕྱུག་དེ་ཡི་གསུང་གི་ཡོན་ཏན་འདི།
en: These are the qualities of the Dharma Lord ’s speech.

source: །སྟོན་པའི་མགུལ་མཛེས་དུང་དང་འདྲ་ཞིང་དཔུང་མགོ་ཟླུམ།
en: “ ‘The teacher’s neck is lovely like a conch, his shoulders and head are round,

source: །དབྱུག་པ་ལྟ་བུར་ཕྱག་རིང་དེ་ཡི་བདུན་ཡང་མཐོ།
en: His arms are long like staves, he has the seven prominent body parts.

source: །ཕྱག་མཛེས་སྣ་ཚོགས་སོར་མོ་རྣམས་ནི་རིང་ཞིང་ཟླུམ།
en: His hands are elegant, his fingers are elongated and round.

source: །རྒྱལ་བ་དེ་ཡི་སྐུ་ནི་བཙོ་མའི་གསེར་གྱི་མདོག །བ་སྤུ་གཡས་སུ་འཁྱིལ་ཅིང་གྱེན་དུ་རེ་རེ་སྐྱེས།
en: The Victorious One’s body is the color of perfectly pure gold. “ ‘His bodily hair curls to the right, each hair standing straight.

source: །ལྟེ་བ་མཐའ་དག་ཟབ་ཅིང་གསང་སྦུབས་རྟ་ཡི་འདྲ།
en: His navel is deep, and his secret part sheathed like that of a horse.

source: །རང་བྱུང་ཨེ་ནྱའི་བྱིན་པ་གླང་པོའི་སྣ་འདྲའི་བརླ།
en: The Self-Realized One has thighs like elephants’ trunks and the calves of an antelope.

source: །ཞབས་མཐིལ་མཛེས་པར་བྲིས་པ་བཀྲ་ཤིས་འཁོར་ལོའི་མཚན།
en: The soles of his feet are beautifully adorned, marked with auspicious wheels.

source: །གླང་པོའི་དབང་པོའི་འགྲོས་སྟོབས་སེང་གེའི་རྩལ་གྱི་སྟོབས།
en: “ ‘His gait is like that of the chief of elephants, of a courageous lion, And like that of a majestic bull.

source: །ཁྱུ་མཆོག་བསྒྱིངས་པའི་སྟོབས་ཅན་དབང་པོའི་མཆོད་སྡོང་རྒྱས།
en: He is mighty like the nāga Indrayaṣṭi.

source: །མཁའ་ལས་མེ་ཏོག་ཆར་བབ་མེ་ཏོག་གདུགས་སུ་གྱུར།
en: A rain of flowers from the sky forms a canopy of flowers, following him.

source: །གཤེགས་པའི་རྗེས་འགྲོ་འདི་དག་དེ་ཡི་རྨད་བྱུང་ཆོས།
en: These are his marvelous qualities. “ ‘The Victorious One is entirely unstained by gain and loss,

source: །རྒྱལ་བ་རྙེད་དང་མ་རྙེད་བདེ་དང་སྡུག་བསྔལ་དང་། །གྲགས་དང་མ་གྲགས་དེ་བཞིན་བསྟོད་དང་སྨད་པ་ཡིས།
en: Pleasure and suffering, fame and disgrace, and praise and blame,

source: །པད་མ་ཆུ་ལྟར་ཐམས་ཅད་དུ་ཡང་གོས་པ་མེད།
en: Like a lotus unstained by water.

source: །མི་ཡི་སེང་གེ་དེ་འདྲ་མཚུངས་པའི་སེམས་ཅན་མེད།
en: There is no sentient being equal to this lion among men.’

source: །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་གྱིས་སངས་རྒྱས་ཀྱི་བསྔགས་པ་ཐོས་ཤིང་ཆོས་དང་དགེ་འདུན་གྱི་བསྔགས་པ་ཐོས་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ།
en: “Rāṣṭrapāla, once young prince Puṇyaraśmi had heard this praise of the Buddha, Dharma, and Saṅgha, he was contented, happy, delighted, and overjoyed.

source: དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་པར་གྱུར་ཏོ།
en: Happiness and mental pleasure were born in him.

source: །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “Then, Rāṣṭrapāla, young prince Puṇyaraśmi thought the following:

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་ཅི་འདྲ་བ་དང་། དེའི་དགེ་འདུན་ཕུན་སུམ་ཚོགས་པ་ཅི་འདྲ་བ་དང་། དེས་མངོན་སུམ་དུ་བྱས་པའི་ཆོས་ཅི་འདྲ་བ་དང་། དེའི་སློབ་མ་ཕུན་སུམ་ཚོགས་པ་ཅི་འདྲ་བ་དང་། ཇི་ལྟར་འཁོར་བ་ཡ་ང་བ་དང་ཕྲད་པ་དང་། བྱས་པ་མི་གཟོ་བ་དང་། ཇི་ལྟར་འཁོར་བ་ན་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་དག་བྱས་པ་མི་གཟོ་བ་དང་། ཇི་ལྟར་འཇིག་ཚོགས་ལ་ལྟ་བ་ཡ་ང་བ་དང་། ཇི་ལྟར་ཁྱིམ་གྱི་གནས་ཉེས་དམིགས་མང་བ་དང་། ཇི་ལྟར་འདོད་པ་དག་ཉེས་པ་མང་བ་དང་། ཇི་ལྟར་མཁས་པ་རྣམས་ཀྱིས་བག་མེད་པ་དམད་པ་དང་། ཇི་ལྟར་མ་རིག་པའི་མུན་ནག་རྨོངས་པ་དང་། ཇི་ལྟར་འདུ་བྱེད་རྣམས་རྟོགས་པར་དཀའ་བ་དང་། ཇི་ལྟར་སེམས་གདུལ་དཀའ་བ་དང་། ཇི་ལྟར་མིང་དང་གཟུགས་ཟབ་པ་དང་། ཇི་ལྟར་སྐྱེ་མཆེད་དྲུག་དབུགས་འབྱིན་པ་མེད་པ་དང་། ཇི་ལྟར་རེག་པ་ཡོངས་སུ་མ་ཤེས་ཏེ་སྡུག་བསྔལ་རྣམ་པར་སྨིན་པ་དང་། ཇི་ལྟར་ཚོར་བ་ཉེས་དམིགས་མང་བ་དང་། ཇི་ལྟར་སྲིད་པའི་འཆིང་བ་དམ་པ་དང་། ཇི་ལྟར་ཉེ་བར་ལེན་པ་ལས་འབྱུང་བར་དཀའ་བ་དང་། ཇི་ལྟར་སྲིད་པའི་སྲེད་པའི་འཕགས་པ་མ་ཡིན་པ་དང་། ཇི་ལྟར་སྲིད་པ་ཡོད་ན་སྐྱེ་བ་རྒྱུན་གཅད་དཀའ་བ་དང་། ཇི་ལྟར་དགའ་བ་རྣམ་པར་འགྱུར་བར་བྱེད་པ་དང་། ཇི་ལྟར་ནད་ཀྱིས་རྣམ་པར་འཇིག་པར་བྱེད་པ་དང་། ཇི་ལྟར་འཆི་བ་རྗེས་སུ་མི་སྲུང་བ་དང་། ཇི་ལྟར་འཇུག་པ་རོ་བྲོ་བ་ཆུང་བ་དང་། ཇི་ལྟར་སྲིད་པར་མངོན་པར་འགྲུབ་པ་ཉེས་དམིགས་མང་བ་དང་། ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ཉམས་དགའ་བ་ལྟར་འདི་མི་ནུས་ཏེ།
en: “ ‘What is the Buddha, the Bhagavān, like? What is the excellent Saṅgha like? What is the Dharma that he revealed like? What are his excellent disciples like, so that they realize how saṃsāra is frightful and antagonistic; how in saṃsāra, childish ordinary beings are ungrateful; how the view that the aggregates are a person is frightful; how household life has many drawbacks;

source: འདོད་པའི་ཁོལ་པོ་ཉོན་མོངས་པ།
en: how passions have many faults; how recklessness is condemned by the learned ones;

source: རྨོངས་པ།
en: how the darkness of ignorance brings delusion; how formative predispositions are difficult to realize;

source: སེམས་ཐ་བ་ཅན།
en: how the mind is difficult to tame; how mind and matter are profound; how the six sense fields are not reliable; how, when sensory contact is not thoroughly understood, suffering will ripen; how sensations have all sorts of drawbacks; how becoming is a true fetter; how it is difficult to escape from appropriation;

source: བག་མེད་པ་ལ་དགའ་བ།
en: how craving for worldly existence is not noble;

source: བྱིས་པའི་ནང་ན་འདུག་པ།
en: how, when there is worldly existence, the continuity of birth is difficult to terminate; how old age brings change; how sickness causes destruction;

source: ཚུལ་བཞིན་མ་ཡིན་པའི་སེམས་དང་ལྡན་པ།
en: how one is not protected after death; how the transition stage is abhorrent;

source: འཁོར་བ་ལ་ཆགས་པའི་སེམས་དང་ལྡན་པ།
en: how the emergence into existence has many drawbacks; and how the teaching of the Tathāgata is delightful. “ ‘These realizations are not possible for those who are slaves to desire, impaired by afflictions, deluded, and hardhearted, who take pleasure in recklessness, who live among fools, who have improper thoughts and thoughts attached to saṃsāra, and who reside among pernicious men.

source: སྐྱེ་བོ་མ་རུངས་པའི་ནང་ན་འདུག་པས་ནི་བདེ་འགྲོའི་ལམ་ཡང་རྣམ་པར་སྤྱད་པར་མི་ནུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་ལྟ་ག་ལ་འགྱུར་སྙམ་མོ། །དེ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ།
en: And if they are not even able to fully practice the path to higher realms, how could they realize unsurpassable, completely perfect enlightenment?’

source: བདག་སྒོ་ནས་བྱུང་ན་ནི་ཉེ་དུའི་ཚོགས་ཀྱིས་བར་ཆད་བྱས་སུ་འོང་གིས་བདག་ཁང་སྟེང་འདི་ནས་ཐུར་དུ་མཆོང་ངོ་། །སྙམ་མོ།
en: “He thought, ‘If I left through the door, the assembly of my kinsmen would prevent me.

source: །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དོན་གྲུབ་བློ་དེ་ག་ལ་བ་དེ་ལོགས་སུ་ཕྱོགས་ཏེ།
en: Therefore, I will jump from the upper roof of the palace.’

source: ཁང་པ་དེ་ནས་མཆོངས་ནས་ཚིག་འདི་སྐད་དུ་གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་དེ་ཐམས་ཅད་མཁྱེན་ཅིང་ཐམས་ཅད་གཟིགས་ཤེ་ན། དེ་བཞིན་གཤེགས་པ་དེས་བདག་ལ་དགོངས་སུ་གསོལ།
en: “At this point, Rāṣṭrapāla, young prince Puṇyaraśmi, facing the direction of the Bhagavān, the Tathāgata Siddhārthabuddhi, jumped from the palace, saying, ‘If the Tathāgata knows everything and sees everything, may he pay heed to me.’

source: ཞེས་ཀྱང་སྨྲས་སོ། །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དོན་གྲུབ་བློས་ཕྱག་གཡས་པ་བརྐྱང་སྟེ་འོད་ཕྱུང་ནས།
en: “Just then, Rāṣṭrapāla, the tathāgata, arhat, perfect and complete Buddha Siddhārthabuddhi extended his right hand and issued forth light, which touched Puṇyaraśmi.

source: འོད་དེས་རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་ལ་རེག་གོ །འོད་དེ་ལས་ཀྱང་པད་མ་འདབ་མ་བརྒྱ་སྟོང་ཡོད་པ་ཤིང་རྟའི་འཕང་ལོ་ཙམ་བྱུང་བར་གྱུར་ཏོ།
en: From that light, a hundred-thousand-petaled lotus the size of a chariot wheel emerged.

source: །པད་མ་དེ་ལས་ཀྱང་འོད་ཟེར་བརྒྱ་སྟོང་བྱུང་སྟེ་སྣང་བ་ཆེན་པོར་གྱུར་ནས།
en: From that lotus, a hundred thousand light rays shone forth, and there was a great brightness.

source: སྣང་བ་དེས་རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་ཁྱབ་པར་གྱུར་ཏོ།
en: Young prince Puṇyaraśmi was enveloped by this brightness.

source: །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་པད་མ་དེ་ལ་འདུག་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དོན་གྲུབ་བློ་དེ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ལན་གསུམ་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་དོ། །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དོན་གྲུབ་བློ་དེས་འོད་དེ་བརྟུལ་བ་དང་གཞོན་ནུ་དེ་སྡོང་པོ་བཅད་པ་འགྱེལ་བ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་ཞབས་ཀྱི་དྲུང་དུ་བབས་ཏེ། དེ་བཞིན་གཤེགས་པ་དེ་ལ་ལན་བརྒྱ་སྟོང་དུ་ཕྱག་འཚལ་ཏོ།
en: Then, Rāṣṭrapāla, young prince Puṇyaraśmi, resting on the lotus, faced the direction of the bhagavān, tathāgata, arhat, perfect and complete Buddha Siddhārthabuddhi, bowed with joined palms, and uttered three times, ‘I pay homage to the Buddha.’ At this point, Rāṣṭrapāla, the Tathāgata Siddhārthabuddhi withdrew the light, and the prince fell at the feet of the tathāgata—just as a tree falls when it is chopped down—and praised the tathāgata a hundred thousand times.

source: །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་གྱིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དོན་གྲུབ་བློ་ལ་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: “Then, Rāṣṭrapāla, young prince Puṇyaraśmi uttered the following verses to the Bhagavān, Tathāgata Siddhārthabuddhi: “ ‘For a long time I was sick;

source: བདག་ནི་རིང་ནས་ན་སྟེ་རིང་ནས་ལྡོངས།
en: for a long time I was blind.

source: །ཚེགས་ཆེས་སྨན་པའི་རྒྱལ་པོ་ཁྱོད་རྙེད་དོ། །ཇི་ལྟར་བདེ་གཤེགས་བསྟན་ལ་གནས་ནས་ནི།
en: Now after great hardship, I have found you, king of physicians.

source: །བདག་གིས་འཐོབ་འགྱུར་མགོན་པོ་བསྟན་དུ་གསོལ།
en: Show me, O protector, how I can be firm And successful in the teaching of the Sugata.

source: །འདྲེན་པ་བདག་གིས་བག་མཆིས་ཐོས་པ་ནི།
en: “ ‘The understanding of conscientiousness, O guide,

source: །མཚན་མོ་བར་སྣང་ལྷ་ལས་ཐོས་ལགས་ཏེ།
en: I have received at night from the gods in the sky.

source: །ཐོས་ནས་སྐྱོ་སྟེ་བདག་ནི་འདིར་མཆིས་ན།
en: Having understood it, I became distraught, thinking,

source: །མི་རྣམས་བག་མཆིས་འགྱུར་བ་ཇི་ལྟ་བུ།
en: “How can people still be reckless?”

source: །ལམ་ཉམས་པ་ལ་དེ་རིང་སྟོན་གྱུར་ཅིག །ལྡོངས་པར་གྱུར་པའི་མིག་ཏུ་དེང་གྱུར་ཅིག །དད་པའི་འབྱུང་གནས་གསོ་མཛད་ཐུགས་རྗེ་ལྡན།
en: “ ‘Now be the guide for one who has lost his way; Now be the eyes for one who is blind from birth. Source of faith, compassionate healer,

source: །གཡང་ས་ཆེན་པོ་འདི་ལས་བདག་ཕྱུང་ཤིང་།
en: Pull me out of this great abyss!

source: །དབུལ་པོར་གྱུར་པ་བདག་ནི་བསྡུ་བར་མཛོད།
en: “ ‘Please favor me, a person in poverty;

source: །མགོན་པོ་བཅིངས་པ་བདག་ནི་དེང་དགྲོལ་མཛོད།
en: Now, O protector, free me, a person in chains.

source: །སོམ་ཉིར་བཅས་པའི་ཡིད་གཉིས་གཅད་དུ་གསོལ།
en: Please cut through my doubtful hesitation

source: །བྱང་ཆུབ་ལམ་ལ་སྤྱོད་པ་བདག་ལུང་སྟོན།
en: And clarify the conduct on the path to enlightenment!

source: །ཆུས་ཁྱེར་བདག་ལ་འགྲམ་ནི་བསྟན་དུ་གསོལ།
en: “ ‘As I am swept away by the river, please show me the shore;

source: །མུན་པ་བདག་ལ་སྒྲོན་མ་མཛད་དུ་གསོལ།
en: Be a lamp for me in the darkness.

source: །རྨར་གྱུར་བདག་ལ་རྨ་མེད་མཛད་དུ་གསོལ། །སྨན་པའི་རྒྱལ་པོ་བདག་གི་ཟུག་རྔུ་ཕྱུང་།
en: Heal my wounds, O king of physicians, And remove from me the thorn of pain!

source: །ཁྱོད་ཀྱིས་ངན་འགྲོ་དག་ལས་བདག་ཐར་མཛོད།
en: “ ‘Liberate me from lower destinies,

source: །སྲིད་པར་དམིགས་པ་འཛིན་པ་གཅད་དུ་གསོལ།
en: And sever the clinging of my preoccupation with the world!

source: །ཡན་ལག་བརྒྱད་པའི་ལམ་གྱི་ལམ་ཆེན་གྱིས། །མྱ་ངན་ཆུ་ཆེན་ཕ་རོལ་བསྒྲལ་དུ་གསོལ།
en: Deliver me to the other side of the vast river of suffering With the great eightfold path.

source: །སྲོག་ནི་ཟད་པའི་ཆོས་ཅན་ཚེ་ཡང་ཐུང་།
en: “ ‘Life is perishable, our time is short,

source: །དགེ་བ་བར་ཆད་མང་པོ་འབྱུང་བ་སྟེ།
en: And there are many obstacles to virtue.

source: །བསོད་ནམས་རྣམ་སྨིན་རིང་པོར་མི་ཐོགས་འགྲུབ།
en: My merit will ripen before long.

source: །བདག་གིས་དལ་བ་དོན་རྙེད་གཅིག་ངེས་གསུངས།
en: Now that I have attained this opportunity, teach me the only certain thing. “ ‘Clarify for me, O protector of the world, the following:

source: །བྱང་ཆུབ་སེམས་དཔའ་ཇི་ལྟར་བག་མཆིས་འགྱུར།
en: How should a bodhisattva be conscientious?

source: །ཇི་ལྟར་བྱང་ཆུབ་སྤྱོད་པ་མཆོག་སྤྱད་པ། །འགྲོ་བ་སྲིད་པའི་འཆིང་ལས་ཐར་འགྱུར་བ།
en: How does a bodhisattva engage in the supreme enlightened conduct?

source: །འཇིག་རྟེན་མགོན་པོ་དེ་དག་བདག་ལུང་སྟོན།
en: How shall I liberate the world from the chains of existence?’

source: །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དོན་གྲུབ་བློས་རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་གྱི་ལྷག་པའི་བསམ་པ་མཁྱེན་ནས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་ཆེར་ཡང་དག་པར་བསྟན་ཏོ།
en: “Thereafter, Rāṣṭrapāla, the Tathāgata Siddhārthabuddhi, upon realizing young prince Puṇyaraśmi’s extraordinary intent, extensively explained to him the conduct of a bodhisattva.

source: །རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་གྱིས་དེ་ཐོས་ནས། རྣམ་པར་ཐར་པ་ཞེས་བྱ་བའི་གཟུངས་ཐོབ་བོ།
en: “Listening to him, young prince Puṇyaraśmi attained the dhāraṇī called complete liberation

source: །མངོན་པར་ཤེས་པ་ལྔ་ཡང་ཐོབ་སྟེ།
en: He also attained the five kinds of superknowledge;

source: དེ་ནམ་མཁའ་ལ་གནས་ནས་མེ་ཏོག་རྣམས་མངོན་པར་སྤྲུལ་ཏེ་དེ་བཞིན་གཤེགས་པ་དེ་ལ་གཏོར། མངོན་པར་གཏོར་ཏོ།
en: and, flying through the air, he emanated flowers and tossed them copiously upon the tathāgata.

source: །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་བར་སྣང་དེ་ལས་བབས་ཏེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དོན་གྲུབ་བློ་དེ་ལ་ཚིགས་སུ་བཅད་པས་མངོན་པར་བསྟོད་པ།
en: Next, Rāṣṭrapāla, young prince Puṇyaraśmi descended from the sky and greatly praised the Bhagavān, the Tathāgata Siddhārthabuddhi, with the following verses:

source: མཚན་མཆོག་ལྡན་པ་དྲི་མེད་ཟླ་བའི་ཞལ། །གསེར་མདོག་འདྲ་བ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: “ ‘I praise you, one who is endowed with the supreme buddha marks, Undefiled moon-faced being of golden color!

source: །རྡུལ་བྲལ་ཁྱོད་འདྲ་སྲིད་པ་གསུམ་མ་མཆིས།
en: I praise you, one who is immaculate, unrivaled in the three worlds,

source: །མཉམ་མེད་མཁྱེན་ཆེན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: You with unequaled great wisdom!

source: །རྒྱལ་བའི་དབུ་སྐྲ་འཇམ་མཛེས་སྣུམ་ཞིང་བཟང་།
en: “ ‘Your hair, O Victorious One, is gentle, beautiful, glossy, and superb.

source: །ཁྱོད་ཀྱི་གཙུག་ཏོར་འདི་ན་རི་རྒྱལ་བཞིན།
en: Your uṣṇīṣa is like the king of mountains in this world.

source: །གཙུག་ཏོར་མི་མཐོང་ཁྱོད་དང་མཚུངས་མ་མཆིས།
en: One with such a protuberance has never been seen; you are unequaled.

source: །ཐུབ་པ་ཁྱོད་ཀྱི་སྨིན་མཚམས་མཛོད་སྤུ་མཛེས།
en: Between your eyebrows, O Sage, you have a beautiful hair tuft.

source: །ཀུན་ད་ཟླ་བ་ཁ་བ་དུང་ལྟར་དཀར། །ཐུགས་རྗེ་གང་གིས་འགྲོ་བ་འདི་གཟིགས་པ།
en: “ ‘It is white like jasmine, the moon, and a conch shell.

source: །སྤྱན་མཆོག་བཟང་པོ་ཨུད་པལ་སྔོན་པོ་འདྲ།
en: Your excellent eyes are like blue lotuses— Through them you behold this world with compassion.

source: །རྒྱལ་བ་དྲི་མེད་སྤྱན་ལ་ཕྱག་འཚལ་ལོ།
en: I praise you, the Victorious One whose eyes are stainless.

source: །ལྗགས་ཡངས་སྲབ་ལ་ཟངས་ཀྱི་མདོག་འདྲ་བ།
en: “ ‘The color of your large and thin tongue is like that of copper.

source: །དེ་ཡིས་རང་གི་ཞལ་གྱི་གདོང་ཡང་ཁེབས།
en: Your tongue can even cover your face.

source: །ཆོས་གསུང་བས་ནི་འགྲོ་བ་འདུལ་བར་མཛད།
en: Teaching the Dharma, you tame the world.

source: །འཇམ་སྣུམ་གསུང་ལྡན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: I praise you, one who has a gentle and tender voice.

source: །ཚེམས་བཟང་ཤིན་ཏུ་བརྟན་པ་རྡོ་རྗེ་འདྲ།
en: “ ‘Your excellent teeth are extremely firm like diamonds.

source: །བཅུ་དང་སུམ་ཅུ་སྙོམས་ཤིག་ཐགས་བཟང་བ།
en: They are forty, straight without gaps.

source: །འཛུམ་པ་མཛད་ན་འགྲོ་བ་འདུལ་བར་བགྱིད།
en: When you smile, you tame the world.

source: །བདེན་གཏམ་སྙན་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: I praise you, one whose speech is true and pleasant.

source: །རྒྱལ་བ་ཁྱོད་ཀྱི་གཟུགས་དང་མཚུངས་མ་མཆིས།
en: “ ‘Your physique, Victorious One, is unequaled.

source: །འོད་ཀྱིས་ཞིང་བརྒྱ་དག་ཀྱང་སྣང་བར་བགྱིད།
en: With your light, you illuminate hundreds of buddhafields.

source: །འཇིག་རྟེན་ན་ནི་ཚངས་དབང་སྐྱོང་དེ་དག །བཅོམ་ལྡན་ཁྱོད་ཀྱི་འོད་ཀྱིས་ཟིལ་དུ་བརླག །ཨེ་ནྱའི་བྱིན་པ་མཉམ་མེད་བཅོམ་ལྡན་འདས།
en: Brahmā and Indra, the protectors of the world, Are outshone by your splendor, Bhagavān. “ ‘Your antelope-like calves are unequaled, O Bhagavān!

source: །གླང་པོའི་རྒྱལ་པོ་རྨ་བྱ་སེང་གེའི་སྟབས།
en: Your gait is like that of the king of elephants, the peacock, and the lion.

source: །བཅོམ་ལྡན་གཉའ་ཤིང་གང་དུ་གཟིགས་ཤིང་གཤེགས།
en: Bhagavān, you stride gazing a plough’s length ahead,

source: །ས་དང་རི་དང་དམ་པ་གཡོ་བར་མཛད།
en: Making the earth and mountain slopes tremble.

source: །བཅོམ་ལྡན་ཁྱོད་སྐུ་མཚན་གྱིས་བརྒྱན་པ་སྟེ།
en: “ ‘Bhagavān, your body is adorned with the buddha marks;

source: །ཁྱོད་ཀྱི་ལྤགས་པ་འཇམ་ཞིང་གསེར་མདོག་འདྲ།
en: Your skin is soft and golden hued.

source: །འགྲོ་བས་གཟུགས་འདི་ལྟ་བས་ངོམས་མི་འགྱུར།
en: Beings never tire of beholding such a body.

source: །ཁྱོད་ནི་མཚུངས་པ་མ་མཆིས་གཟུགས་དང་ལྡན།
en: Your body is incomparable.

source: །ཁྱོད་སྔོན་བསྐལ་པ་བརྒྱར་ནི་དཀའ་ཐུབ་སྤྱད།
en: “ ‘I praise you, one who practiced austerities for hundreds of former eons,

source: །ཁྱོད་གཏོང་དུལ་དང་སྦྱིན་པ་ཀུན་ལ་དགྱེས།
en: Who has delighted in all forms of renouncing, taming, and giving,

source: །སེམས་ཅན་ཀུན་ལ་ཐུགས་རྗེ་བྱམས་ཐུགས་ལྡན།
en: The one endowed with a mind of compassion and loving kindness toward all sentient beings,

source: །མཆོག་ཏུ་ཐུགས་རྗེ་ཅན་ལ་ཕྱག་འཚལ་ལོ།
en: The possessor of supreme compassion.

source: །ཁྱོད་ནི་སྦྱིན་དང་ཚུལ་ཁྲིམས་རྟག་ཏུ་དགྱེས།
en: “ ‘I praise you, one who is always devoted to generosity and discipline,

source: །ཁྱོད་ནི་བཟོད་དང་བརྩོན་འགྲུས་དགྱེས་རབ་བརྟན།
en: Who is firmly devoted to patience and diligence,

source: །ཁྱོད་ནི་བསམ་གཏན་ཤེས་རབ་འོད་གཟི་མངའ།
en: Holder of the luminous splendor of meditative absorption and insight,

source: །མཚུངས་མེད་ཡེ་ཤེས་མངའ་ལ་ཕྱག་འཚལ་ལོ།
en: And holder of unequaled wisdom.

source: །ཁྱོད་ནི་སྨྲ་བ་ངན་པའི་ཚོགས་ཅན་འཇོམས།
en: “ ‘You, hero of speech, conquer bad teachers.

source: །ཁྱོད་ནི་སེང་གེ་ལྟ་བུར་འཁོར་དུ་སྒྲོགས།
en: You roar like a lion in the assembly.

source: །ཁྱོད་ནི་སྨན་པའི་རྒྱལ་པོ་དྲི་གསུམ་སེལ། །མཆོག་ཏུ་དགའ་མཛད་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: O king of physicians who dispels the three stains, I praise you, one who brings supreme happiness! “ ‘Your body, speech, and mind, O Sage, are completely pure,

source: །ཐུབ་པ་སྐུ་གསུང་ཐུགས་ནི་རྣམ་པར་དག །པད་མ་ཆུས་ལྟར་སྲིད་པ་གསུམ་མི་གོས།
en: Untainted in the three worlds, like a lotus in water.

source: །ཁྱོད་ནི་ཚངས་དབྱངས་ཀ་ལ་པིང་ཀའི་སྐད།
en: Your Brahmā voice is like the voice of a kalaviṅka bird.

source: །སྲིད་གསུམ་ཕ་རོལ་གཤེགས་ལ་ཕྱག་འཚལ་ལོ།
en: I praise you, one who has passed beyond the three worlds.

source: །ཁྱོད་ཀྱིས་འགྲོ་འདི་སྒྱུ་མ་ལྟ་བུ་དང་། །གར་ལ་ལྟ་དང་རྨི་ལམ་འདྲ་བ་དང་། །བདག་མེད་སེམས་ཅན་མེད་ཅིང་སྲོག་འགྲོ་མེད།
en: “ ‘You know this world to be like an illusion, Like an actor’s theater, and like a dream; That there is no self, no sentient being, and no life, along with no realms;

source: །ཆོས་རྣམས་སྨིག་རྒྱུ་ཆུ་ཟླ་འདྲ་བར་མཁྱེན།
en: And that phenomena are mirages, like the moon in water. “ ‘Beings wander, not knowing that things

source: །སྟོང་པ་ཞི་བ་སྐྱེ་བ་མེད་པའི་ཚུལ།
en: Are empty, peaceful, and non-arisen.

source: །མ་ཤེས་པས་ནི་འགྲོ་བ་འཁྱམས་གྱུར་ཏེ།
en: Out of compassion, you cause them to enter the path

source: །ཐུགས་རྗེ་ཐབས་ཚུལ་རིགས་པ་བརྒྱ་དག་གིས།
en: With hundreds of skillful means, methods, and principles. “ ‘You always behold beings

source: །དེ་དག་རྣམས་ནི་འཛུད་པར་མཛད་པ་ལགས། །འདོད་ཆགས་ལ་སོགས་ནད་མང་བརྒྱ་དག་གིས།
en: Terrified by hundreds of maladies, such as desire.

source: །སྐྲག་པར་གྱུར་པའི་འགྲོ་ལ་རྟག་གཟིགས་ཏེ།
en: Like a peerless physician, O Sugata, you make the rounds,

source: །བདེ་གཤེགས་སེམས་ཅན་བརྒྱ་དག་ཡོངས་འགྲེལ་ཅིང་།
en: Completely liberating hundreds of beings.
